<div style="text-align: left;">
<table style="width:100%; background-color:transparent;">
  <tr style="background-color:transparent;">
    <td style="background-color:transparent;"><a href="http://www.datascience-paris-saclay.fr">
<img border="0" src="http://project.inria.fr/saclaycds/files/2017/02/logoUPSayPlusCDS_990.png" width="90%"> </td>
width="60%"> </td>
  </tr>
</table> 
</div>

<center><h1>Notre beau projet</h1></center>
<br/>
<center>Pierre Eustache, Simon Free, Timoth√© Krauth, Fanny Streiff, Nicolas Urien</center>

## Table of Contents

0. [Introduction](#Introduction)
1. [Data](#Data)
2. [Data exploration](#Data-exploration)

# Introduction

The objective of this challenge is to work with many datasets.

There are two datasets in this challenge:

* `Employment rate.csv` 
* `Governement Debt.csv` 
* `Greenhouse Gases.csv` 
* `Inflows.csv` 
* `Health.csv` 
* `Population.csv` 
* `Taxes.csv` 

# Aim

The predictive aim of this challenge is to use those datasets to predict the number of immigrant for each OCDE's country per year

# Data

# Data exploration

In [68]:
%matplotlib inline
import imp
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [69]:
Erates = pd.read_csv('data/Employment rate.csv')
drop_cols = ['COUNTRY','BIRTH', 'GENDER', 'RATE', 'YEAR', 'Unit Code', 'PowerCode Code', 'Reference Period Code', 'Flag Codes']
Erates = Erates.drop(drop_cols,axis=1)
Gdebt = pd.read_csv('data/Governement Debt.csv')
drop_cols = ['COU','DTYP', 'FREQ', 'UNIT', 'DVAR', 'TIME', 'Flag Codes']
Gdebt = Gdebt.drop(drop_cols,axis=1)
Ggases = pd.read_csv('data/Greenhouse Gases.csv')
drop_cols = ['POL', 'VAR', 'YEA', 'Unit Code', 'PowerCode Code', 'Reference Period Code', 'Flag Codes']
Ggases = Ggases.drop(drop_cols,axis=1)
health = pd.read_csv('data/Health.csv')
drop_cols = ['HF','HC', 'HP', 'MEASURE', 'LOCATION', 'Unit Code', 'PowerCode Code', 'Reference Period Code', 'Flag Codes']
health = health.drop(drop_cols,axis=1)
inflows = pd.read_csv('data/Inflows.csv')
drop_cols = ['CO2','VAR', 'GEN', 'COU', 'YEA', 'Flag Codes']
inflows = inflows.drop(drop_cols,axis=1)
population = pd.read_csv('data/Population.csv')
drop_cols = ['LOCATION','AGE', 'SEX', 'TIME', 'Flag Codes']
population = population.drop(drop_cols,axis=1)
taxes = pd.read_csv('data/Taxes.csv')
drop_cols = ['LOCATION','FAMILY', 'UBMAINBEN', 'DURATION', 'EARNINGS', 'HBTOPUPS', 'INTOWBEN', 'TIME', 'Flag Codes']
taxes = taxes.drop(drop_cols,axis=1)

In [70]:
Erates.head(3)

,Country,Place of birth,Gender,Rate,Year,Unit,PowerCode,Reference Period,Value,Flags
0,Australia,Foreign-born,Men,Employment rate,2000,Percentage,Units,NaN,74.0,NaN
1,Australia,Foreign-born,Men,Employment rate,2001,Percentage,Units,NaN,73.9,NaN
2,Australia,Foreign-born,Men,Employment rate,2002,Percentage,Units,NaN,74.0,NaN

In [71]:
Gdebt.head(3)

,Country,Type,Frequency,Unit,Variable,Time period,Value,Flags
0,Australia,Stocks: Outstanding amounts,Annual,Million USD,Total central government debt,2000,46472.311,NaN
1,Australia,Stocks: Outstanding amounts,Annual,Million USD,Total central government debt,2001,35119.508,NaN
2,Australia,Stocks: Outstanding amounts,Annual,Million USD,Total central government debt,2002,37785.120,NaN

In [72]:
Ggases.head(3)

,COU,Country,Pollutant,Variable,Year,Unit,PowerCode,Reference Period,Value,Flags
0,AUS,Australia,Greenhouse gases,Total emissions excluding LULUCF,1990,Tonnes of CO2 equivalent,Thousands,NaN,420315.323,NaN
1,AUS,Australia,Greenhouse gases,Total emissions excluding LULUCF,1991,Tonnes of CO2 equivalent,Thousands,NaN,421381.463,NaN
2,AUS,Australia,Greenhouse gases,Total emissions excluding LULUCF,1992,Tonnes of CO2 equivalent,Thousands,NaN,425702.483,NaN

In [73]:
health.head(3)

,Financing scheme,Function,Provider,Measure,Country,TIME,Year,Unit,PowerCode,Reference Period,Value,Flags
0,All financing schemes,Current expenditure on health (all functions),All providers,Share of gross domestic product,Denmark,2010,2010,Percentage,Units,NaN,10.333,Break
1,All financing schemes,Current expenditure on health (all functions),All providers,Share of gross domestic product,Denmark,2011,2011,Percentage,Units,NaN,10.153,NaN
2,All financing schemes,Current expenditure on health (all functions),All providers,Share of gross domestic product,Denmark,2012,2012,Percentage,Units,NaN,10.241,NaN

In [74]:
inflows.head(3)

,Country of birth/nationality,Variable,Gender,Country,Year,Value,Flags
0,Afghanistan,Inflows of foreign population by nationality,Total,Australia,2000,887.0,NaN
1,Afghanistan,Inflows of foreign population by nationality,Total,Australia,2001,456.0,NaN
2,Afghanistan,Inflows of foreign population by nationality,Total,Australia,2002,660.0,NaN

In [75]:
population.head(3)

     Country    Sex    Age  Time       Value  Flags
0  Australia  Women  Total  2005  10157211.0    NaN
1  Australia  Women  Total  2006  10291542.0    NaN
2  Australia  Women  Total  2007  10473986.0    NaN

In [76]:
taxes.head(3)

,Country,Family type,Main out-of-work benefit,Unemployment duration (months),Earnings in the new job,Include housing benefits,Include temporary into-work benefits,Year,Value,Flags
0,Belgium,Single person without children,Guaranteed Minimum Income (GMI) benefits,2,Minimum Wage,Yes,Yes,2001,67,NaN
1,Belgium,Single person without children,Guaranteed Minimum Income (GMI) benefits,2,Minimum Wage,Yes,Yes,2002,68,NaN
2,Belgium,Single person without children,Guaranteed Minimum Income (GMI) benefits,2,Minimum Wage,Yes,Yes,2003,66,NaN

In [77]:
print('Erates.shape:',Erates.shape)
print('Gdebt.shape:',Gdebt.shape)
print('Ggases.shape:',Ggases.shape)
print('health.shape:',health.shape)
print('inflows.shape:',inflows.shape)
print('population.shape:',population.shape)
print('taxes.shape:',taxes.shape)

Erates.shape: (10284, 10)
Gdebt.shape: (43392, 8)
Ggases.shape: (51614, 10)
health.shape: (33815, 12)
inflows.shape: (458192, 7)
population.shape: (68208, 6)
taxes.shape: (474112, 10)

In [79]:
Erates.dtypes

Country                                  object
Family type                              object
Main out-of-work benefit                 object
Unemployment duration (months)            int64
Earnings in the new job                  object
Include housing benefits                 object
Include temporary into-work benefits     object
Year                                      int64
Value                                     int64
Flags                                   float64
dtype: object

In [80]:
Erates.describe()

       Unemployment duration (months)           Year          Value  Flags
count                     474112.0000  474112.000000  474112.000000    0.0
mean                           9.5000    2010.041037      58.954180    NaN
std                            7.4666       5.036314      23.567151    NaN
min                            2.0000    2001.000000     -51.000000    NaN
25%                            3.5000    2006.000000      42.000000    NaN
50%                            7.0000    2010.000000      64.000000    NaN
75%                           13.5000    2014.000000      76.000000    NaN
max                           24.0000    2018.000000     139.000000    NaN

In [81]:
Erates.nunique()

Country                                  42
Family type                               8
Main out-of-work benefit                  2
Unemployment duration (months)            7
Earnings in the new job                   3
Include housing benefits                  2
Include temporary into-work benefits      2
Year                                     18
Value                                   180
Flags                                     0
dtype: int64